app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2009-11-19 03:08:02', '3a6106eb876c8afa79bb81ad84d0b93089ef5686779d090b0516216102baaa35eea5c8c1a48c5185a39558ee6b9b8e20c168a733ce7330d32929762b080d2a7b', '2009-11-19 03:08:02', 'trevorhartman', 'pRgLRZb-wUKRFIVzdntU', '754861820ebeea734c9a0a73322499a108b49f29385dabbe5fed0591523e1f79154c2a5656a3b0455ce204452b3aaeafd57e39b762ce1464f149e33884b08e41', 'trevorhartman@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save